In [4]:
import numpy as np
import pandas as pd
from sklearn.linear_model import LogisticRegression
from sklearn import preprocessing

In [36]:
data = pd.read_csv('train.csv')
data.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [37]:
data.drop('Name',axis = 1,inplace = True)
data.drop('Cabin',axis = 1,inplace = True)
data.drop('Ticket',axis = 1,inplace = True)

In [38]:
data.head()

   Pclass     Sex   Age  SibSp  Parch    Fare Embarked  Survived
0       2  female  29.0      1      0  26.000        S         1
1       3    male   NaN      0      0   8.050        S         0
2       2    male  39.0      0      0  26.000        S         0
3       3  female  29.0      0      4  21.075        S         0
4       3    male  25.0      0      0   7.050        S         0

In [44]:
print(data)

genders = {"male": 0, "female": 1}
data1 = [data]

for dataset in data1:
    dataset['Sex'] = dataset['Sex'].map(genders)

embarked = {"S":0,"Q":1,"C":2}

for d in data1:
    d["Embarked"] = d["Embarked"].map(embarked) 

mean = data["Age"].mean()
std = data["Age"].std()

data.Age.fillna(mean,inplace = True)
data.Embarked.fillna(0,inplace = True)

data.isnull().sum()

     Pclass     Sex       Age  SibSp  Parch     Fare Embarked  Survived
0         2  female  29.00000      1      0  26.0000        S         1
1         3    male  29.70056      0      0   8.0500        S         0
2         2    male  39.00000      0      0  26.0000        S         0
3         3  female  29.00000      0      4  21.0750        S         0
4         3    male  25.00000      0      0   7.0500        S         0
..      ...     ...       ...    ...    ...      ...      ...       ...
663       2  female  17.00000      0      0  10.5000        S         1
664       3    male  29.70056      0      0   7.7500        Q         0
665       3    male  32.00000      0      0  56.4958        S         1
666       3  female  22.00000      0      0   9.8375        S         0
667       3  female  29.70056      1      0  15.5000        Q         1

[668 rows x 8 columns]

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [50]:
data = data.values

array([[ 2.       ,  1.       , 29.       , ..., 26.       ,  0.       ,
         1.       ],
       [ 3.       ,  0.       , 29.7005597, ...,  8.05     ,  0.       ,
         0.       ],
       [ 2.       ,  0.       , 39.       , ..., 26.       ,  0.       ,
         0.       ],
       ...,
       [ 3.       ,  0.       , 32.       , ..., 56.4958   ,  0.       ,
         1.       ],
       [ 3.       ,  1.       , 22.       , ...,  9.8375   ,  0.       ,
         0.       ],
       [ 3.       ,  1.       , 29.7005597, ..., 15.5      ,  1.       ,
         1.       ]])

In [53]:
x = data[:,:-1]
y = data[:,-1]
y.shape

(668,)

In [63]:
data1 = pd.read_csv('test.csv')
data1.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [64]:
data1.drop('Name',axis = 1,inplace = True)
data1.drop('Cabin',axis = 1,inplace = True)
data1.drop('Ticket',axis = 1,inplace = True)

In [65]:


genders = {"male": 0, "female": 1}
data2 = [data1]

for dataset in data2:
    dataset['Sex'] = dataset['Sex'].map(genders)
    
print(data2)
    
embarked = {"S":0,"Q":1,"C":2}

for d in data2:
    d["Embarked"] = d["Embarked"].map(embarked) 

mean = data1["Age"].mean()
std = data1["Age"].std()

data1.Age.fillna(mean,inplace = True)
data1.Embarked.fillna(0,inplace = True)

data1.isnull().sum()

[     Pclass  Sex   Age  SibSp  Parch      Fare Embarked
0         2    0   8.0      1      1   36.7500        S
1         1    1  49.0      0      0   25.9292        S
2         3    0   NaN      0      0    7.7375        Q
3         2    1  24.0      2      1   27.0000        S
4         1    0  36.0      0      0   26.2875        S
..      ...  ...   ...    ...    ...       ...      ...
218       3    0  20.0      1      0    7.9250        S
219       1    0  45.0      0      0   26.5500        S
220       1    1  17.0      1      0  108.9000        C
221       3    0  43.0      0      0    6.4500        S
222       2    0  36.5      0      2   26.0000        S

[223 rows x 7 columns]]

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [66]:
data1 = data1.values

In [69]:
scaler = preprocessing.StandardScaler()
scaler.fit(x)
x = scaler.transform(x)
data1 = scaler.transform(data1)
data1

array([[-3.56680918e-01, -7.51267469e-01, -1.70280321e+00, ...,
         6.94117561e-01,  1.03461451e-01, -5.87892987e-01],
       [-1.56002866e+00,  1.33108386e+00,  1.51439177e+00, ...,
        -4.76767618e-01, -1.35477405e-01, -5.87892987e-01],
       [ 8.46666826e-01, -7.51267469e-01, -4.53892900e-04, ...,
        -4.76767618e-01, -5.37176352e-01,  6.54868137e-01],
       ...,
       [-1.56002866e+00,  1.33108386e+00, -9.96589681e-01, ...,
        -4.76767618e-01,  1.69663741e+00,  1.89762926e+00],
       [ 8.46666826e-01, -7.51267469e-01,  1.04358275e+00, ...,
        -4.76767618e-01, -5.65606207e-01, -5.87892987e-01],
       [-3.56680918e-01, -7.51267469e-01,  5.33539639e-01, ...,
         1.86500274e+00, -1.33914039e-01, -5.87892987e-01]])

In [79]:
from sklearn.metrics import accuracy_score
model = LogisticRegression()
model.fit(x,y)
y_pred = model.predict(data1)
print(y_pred)
y_pred.shape

[0. 1. 0. 1. 0. 0. 0. 0. 1. 0. 1. 0. 1. 1. 0. 0. 0. 0. 0. 1. 1. 0. 1. 1.
 0. 1. 0. 0. 1. 1. 0. 0. 0. 0. 0. 1. 1. 0. 0. 0. 1. 0. 0. 0. 1. 1. 0. 1.
 0. 0. 0. 1. 1. 1. 0. 0. 0. 0. 0. 0. 0. 0. 1. 1. 1. 0. 0. 1. 1. 0. 0. 0.
 1. 0. 0. 1. 1. 0. 0. 0. 0. 1. 0. 0. 0. 1. 1. 1. 0. 0. 1. 0. 0. 1. 0. 0.
 0. 0. 0. 1. 1. 0. 1. 0. 1. 1. 0. 0. 0. 0. 0. 1. 1. 0. 1. 0. 0. 1. 0. 0.
 0. 0. 0. 0. 1. 0. 0. 0. 0. 1. 0. 0. 0. 0. 0. 0. 1. 1. 1. 0. 0. 0. 0. 0.
 0. 0. 0. 0. 1. 1. 1. 0. 0. 0. 1. 0. 0. 1. 0. 0. 0. 1. 1. 1. 1. 0. 1. 0.
 1. 1. 1. 1. 1. 0. 1. 0. 0. 0. 0. 1. 0. 0. 0. 1. 1. 0. 1. 0. 1. 0. 0. 0.
 1. 0. 0. 1. 1. 1. 1. 1. 0. 1. 0. 0. 0. 0. 0. 0. 1. 1. 0. 1. 0. 0. 1. 1.
 0. 0. 0. 0. 1. 0. 0.]

(223,)